//
// Created by zhanxiaosong on 2024/4/10.
//
//1.输出 "Hello, World!"

//2.输出整数

//3.输出单个字符

//4.输出浮点数

//5.输出双精度数

//6.两个数字相加

//7.两个浮点数相乘

//8.字符转 ASCII 码

//9.两数相除

//10.数值比较

//11.计算 int, float, double 和 char 字节大小

//12.交换两个数的值

//13.判断奇数/偶数

//14.循环区间范围内的奇数/偶数

//15.判断元音/辅音

//16.判断三个数中的最大数

//17.一元二次方程

//18.判断闰年

//19.判断正数/负数/零

//20.判断字母

//21.计算自然数的和

//22.输出九九乘法口诀表

//23.斐波那契数列

//24.求两数的最大公约数

//25.求两数最小公倍数

//26.阶乘

//27.循环输出26个字母

//28.判断数字为几位数

//29.计算一个数的 n 次方

//30.判断回文数

//31.判断素数

//32.判断Armstrong数(阿姆斯壮数)

//33.求一个整数的所有因数

//34.创建各类三角形图案

//35.表格形式输出数据

//36.实现简单的计算器

//37.计算一个数是否可为两个素数之和

//38.二进制与十进制相互转换

//39.八进制与十进制相互转换

//40.八进制与二进制相互转换

//41.字符串翻转

//42.计算数组元素平均值

//43.输出数组

//44.计算数组元素之和

//45.查找数组中最大的元素值

//46.查找数组中最小的元素

//47.数组拆分与合并

//48.数组拷贝

//49.计算标准偏差

//50.两个矩阵相加

//51.矩阵转换

//52.使用指针访问数组元素

//53.使用引用循环替换数值

//54.判断最大值

//55.删除字符串中的特殊字符

//56.连接字符串

//57.计算字符串长度

//58.查找字符在字符串中出现的次数

//59.字符串中各种字符计算

//60.字符串复制

//61.字符串排序

//62.使用结构体（struct）

//63.复数相加

//64.计算两个时间段的差值

//65.将字符串写入文件

//66.从文件中读取一行

//67.输出当前文件执行代码

//68.约瑟夫生者死者小游戏

//69.五人分鱼